omikuji_app/app/controllers/fortunes_controller.rb

  def index
    @fortunes = Fortune.order(created_at: :desc).limit(10)
---
SELECT "fortunes".* FROM "fortunes" ORDER BY "fortunes"."created_at" DESC LIMIT 10

  def create
    @fortune = Fortune.new(fortune_params)
    @fortune.status = "pending"

    if @fortune.input_text.present?
      if @fortune.save
---
INSERT INTO "fortunes" ("input_text", "sentiment_label", "fortune_text", "rank", "score", "created_at", "updated_at") VALUES ('おはようございませいい天気ですね', 'negative', '「運勢は末吉です。アドバイス:「あなたの運勢は、運勢がいいと感じているので、運勢はいい」', '末吉 (Suekichi)', 0.5910983085632324, '2026-04-24 05:24:50.532731', '2026-04-24 05:24:50.532731') RETURNING "id"

  def show
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE "fortunes"."id" = 10 LIMIT 1